// 正则IPv4
export const IPv4_REG =
  /^(1\d{2}|2[0-4]\d|25[0-5]|[1-9]\d|[1-9])\.((1\d{2}|2[0-4]\d|25[0-5]|[1-9]\d|\d)\.){2}(1\d{2}|2[0-4]\d|25[0-5]|[1-9]\d|\d)$/
// 正整数包括0
export const POSITIVE_0_INT_REG = /^[+]{0,1}(\d+)$/
// 正整数不包括0
export const POSITIVE_INT_REG = /^[1-9]\d*$/
// 0-100整数
export const INT0TO100_REG = /^([0-9]{1,2}|100)$/
// 大写字母、小写字母和标点符号至少包含2种(包含特殊字符)
export const PWD_REG_WITH_ALLOW =
  /^(?![\d]+$)(?![a-z]+$)(?![A-Z]+$)(?![!?~@><."”“':;：；` ,|)(\\/「」+=\-\[\]\{\}#$%^&*]+$)[\da-zA-z!?~@><."”“':;：；` ,|)(\\/「」+=\-\[\]\{\}#$%^&*]{2,20}$/
// 只包含大小写字母、数字以及标点符号(不包含特殊字符 不包含空格)
export const PWD_REG_WITHOUT_ALLOW = /^[\da-zA-z!?~@><.,|\\/「」+=\-\[\]\{\}#$%^&*]{1,20}$/
// "”“':;：；` ,  =》不被允许的密码特殊字符
// 真正的密码校验: 密码中允许出现数字、大写字母、小写字母、特殊字符，但至少包含其中2种且长度在6-20之间（四种符号任取其二或三）
export const PWD_REG =
  /^(?![\d]+$)(?![a-z]+$)(?![A-Z]+$)(?![!?~@><.,|)(\\/「」+=\-\[\]\{\}#$%^&*]+$)[\da-zA-z!?~@><.,|)(\\/「」+=\-\[\]\{\}#$%^&*]{6,20}$/
//鉴权参数
export const AUTH_PARAMS_REG = /^[a-zA-Z_][a-zA-Z0-9_]{1,100}$/
//https或http开头的网站地址,可以在网址后面带端口号
export const WEB_ADDRESS_REG =
  /^(https?):\/\/(?:(?:(\*\.)?(([a-zA-Z\d]*[a-zA-Z][a-zA-Z\d]*)\.)+[a-zA-Z]{2,}|(\*\.)?[a-zA-Z\d-]*[a-zA-Z][a-zA-Z\d-]*(\.[a-zA-Z\d-]*[a-zA-Z][a-zA-Z\d-]*)+)(:\d{1,5})?\b){1,75}$/
//url路径支持通配符
export const PATH_REG = /^\/(?!.*\/$)([^*\/]*\/)*[^*\/]*$/
//url路径不支持通配符
export const PATH_REG_NO = /^\/(?!.*\/$)([^\/]*\/)*[^\/]*$/
//取值规则：长度范围1~1024，支持字母、空格、数字和特定字符（.-_*#!&+|^~'"/:;,=@?<>）。
export const STRING_REG = /^[a-zA-Z0-9 .\-_*#!&+\|^~'"/:;,=@?<>]{1,128}$/

export const WEB_ADDRESS_IPv4_REG =
  /^(?!^(10\.([0-9]{1,2}|[1-9][0-9]{0,2}|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.|172\.(1[6-9]|2[0-9]|3[01])\.|192\.168\.))((25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/

// 用于验证IP地址和子网掩码的正则表达式。
export const ipAndMaskRegex =
  /^((25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)\.){3}(25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)(\/(3[0-2]|[1-2]?\d))?$/

/**
 * 用于验证域名的正则表达式。
 *
 * 该正则表达式支持:
 * - 字母和数字字符 (a-z, A-Z, 0-9)
 * - 中文字符 (Unicode 范围 \u4e00-\u9fa5)
 * - 域名中的连字符 (-)（但不能在开头或结尾）
 * - 域名长度在 1 到 63 个字符之间
 * - 顶级域名 (TLD) 至少包含 2 个字母字符
 * - 中文顶级域名至少包含 2 个字符
 * - CN域名 以**.cn结尾 (例如 `example.hk.cn`)
 */
export const DOMAIN_REG =
  /^(?:[a-z0-9\u00A0-\uFFFF](?:[a-z0-9-\u00A0-\uFFFF]{0,61}[a-z0-9\u00A0-\uFFFF])?\.)+[a-z0-9-\u00A0-\uFFFF]{2,}$/i

/**
 * 用于泛域名验证域名的正则表达式。
 *
 * 该正则表达式支持:
 * - 可选的通配符子域名 (例如 `*.example.com`)
 * - 域名中的字母、数字、连字符和中文字符
 * - 域名段长度在 1 到 63 个字符之间
 * - 顶级域名 至少包含 2 个字母字符或中文字符
 * - CN域名 以**.cn结尾 (例如 `example.hk.cn`)
 */
export const DOMAIN_WI_REG =
  /^(?:\*\.)?(?:[a-z0-9\u00A0-\uFFFF](?:[a-z0-9-\u00A0-\uFFFF]{0,61}[a-z0-9\u00A0-\uFFFF])?\.)+[a-z0-9-\u00A0-\uFFFF]{2,}$/i

// E-mail地址
export const EMAIL_REG = /^\w+([\.\-]\w+)*\@\w+([\.\-]\w+)*\.\w+$/
